CARAVAN/app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def index
    # 記事を全件取得
    @blogs = Blog.all

INSERT INTO "blogs" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "テスト１"], ["category", "テスト２"], ["body", ""], ["created_at", "2020-09-05 13:14:43.657506"], ["updated_at", "2020-09-05 13:14:43.657506"]]
---
  def create
    blog = Blog.new(blog_params)
    blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "テスト"], ["updated_at", "2020-09-05 13:17:28.984587"], ["id", 2]]
---
  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]
---
  def destroy
    blog = Blog.find(params[:id])
    blog.destroy